;Localization add-in for TLE

;-----------------------
; TLE MISSIONS
;-----------------------

; BLAST FROM THE PAST Mission Templates

[ChallengeAbductionGasStation X2MissionTemplate]
DisplayName="Alien Abductions"
Briefing="Alien abduction in progress"
PostMissionType="Alien Abductions"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"

[ChallengeAbductionCemetery X2MissionTemplate]
DisplayName="Alien Abductions"
Briefing="Alien abduction in progress"
PostMissionType="Alien Abductions"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"

[ChallengeTerrorBar X2MissionTemplate]
DisplayName="ADVENT Terror Attack"
Briefing="ADVENT Terror Attack in progress"
PostMissionType="ADVENT Terror Attack"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue at least six civilians"
ObjectiveTextPools[1]="Neutralize all hostile targets"

[ChallengeAbductionTrainyard X2MissionTemplate]
DisplayName="Alien Abductions"
Briefing="Alien abduction in progress"
PostMissionType="Alien Abductions"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"

[ChallengeTerrorPoliceStation X2MissionTemplate]
DisplayName="ADVENT Terror Attack"
Briefing="ADVENT Terror Attack in progress"
PostMissionType="ADVENT Terror Attack"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue at least six civilians"
ObjectiveTextPools[1]="Neutralize all hostile targets"

[ChallengeAbductionFarm X2MissionTemplate]
DisplayName="Alien Abductions"
Briefing="Alien abduction in progress"
PostMissionType="Alien Abductions"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"

[ChallengeAbductionDam X2MissionTemplate]
DisplayName="Alien Abductions"
Briefing="Alien abduction in progress"
PostMissionType="Alien Abductions"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"

; IT CAME FROM THE SEA Mission Templates

[ChallengeAbductionWaterfront X2MissionTemplate]
DisplayName="Investigate Disturbance"
Briefing="Disturbance in progress"
PostMissionType="Disturbance Investigation"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"

[ChallengeTerrorCoastalRadio X2MissionTemplate]
DisplayName="ADVENT Terror Attack"
Briefing="ADVENT Terror Attack in progress"
PostMissionType="ADVENT Terror Attack"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue at least six civilians"
ObjectiveTextPools[1]="Neutralize all hostile targets"

[ChallengeGatherWaterfrontRadio X2MissionTemplate]
DisplayName="Gather Pirate DJ from Abandoned City"
Briefing="Gather Pirate DJ from Abandoned City"
PostMissionType="Gather DJ"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Gather Pirate DJ"
ObjectiveTextPools[1]="Deliver DJ to extraction point"

[ChallengeDestroyWaterfrontRadio X2MissionTemplate]
DisplayName="Destroy the Pirate Transmitter"
Briefing="Destroy Pirate Transmitter"
PostMissionType="Destroy the Pirate Transmitter"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Destroy Pirate Transmitter"

[ChallengeExtractCoastalRadio X2MissionTemplate]
DisplayName="Extract DJ from Coastal Shantytown"
Briefing="Extract DJ from Coastal Shantytown"
PostMissionType="Extract DJ"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Deliver DJ to extraction point"

[ChallengeHackWaterfrontRadio X2MissionTemplate]
DisplayName="Hack the Pirate Radio"
Briefing="Hack Workstation - Pirate Radio"
PostMissionType="Hack Pirate Radio"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Hack the pirate radio"

[ChallengeSabotageWaterfrontTransmitter X2MissionTemplate]
DisplayName="Sabotage the Alien Transmitter"
Briefing="Sabotage Alien Transmitter"
PostMissionType="Sabotage Alien Transmitter"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Advent_Facility"
ObjectiveTextPools[0]="Place X4 charges on the alien transmitter"
ObjectiveTextPools[1]="Escape the Area of Operations"

; AVENGER ASSEMBLE Mission Templates

[ChallengeRecoverChair X2MissionTemplate]
DisplayName="Recover Avalanche Missiles from Crashed Interceptor"
Briefing="Recover Avalanche Missiles - Crashed Interceptor"
PostMissionType="Recover Avalanche Missiles"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover Avalanche Missiles from Crashed Interceptor"

[ChallengeRecoverRotor X2MissionTemplate]
DisplayName="Recover Rotor Assembly from Crashed Skyranger"
Briefing="Recover Rotor - Crashed Skyranger"
PostMissionType="Recover Rotor Assembly"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover Rotor Assembly from Crashed Skyranger"

[ChallengeRecoverMissiles X2MissionTemplate]
DisplayName="Recover Pilot Seat from Crashed Interceptor"
Briefing="Recover Seat - Crashed Interceptor"
PostMissionType="Recover Seat"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover Pilot Seat from Crashed Interceptor"

[ChallengeHackPowerGrid X2MissionTemplate]
DisplayName="Hack the UFO AI System"
Briefing="Hack - UFO AI"
PostMissionType="Hack UFO AI"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Hack the makeshift power grid"

[ChallengeGatherSkyranger X2MissionTemplate]
DisplayName="Gather Black Market Operator from Crashed Skyranger"
Briefing="Gather Black Market Operator from Crashed Skyranger"
PostMissionType="Gather Black Market Operator"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Gather Black Market Operator"
ObjectiveTextPools[1]="Deliver Operator to extraction point"

[ChallengeProtectUFODevice X2MissionTemplate]
DisplayName="Protect the Device near Crashed UFO"
Briefing="Protect Device - Crashed UFO"
PostMissionType="Protect Device"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Secure and protect the transmitter"

[ChallengeRecoverManual X2MissionTemplate]
DisplayName="Recover Power Stabilizer from Landed UFO"
Briefing="Recover Power Stabilizer - Landed UFO"
PostMissionType="Recover Power Stabilizer"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover Power Stabilizer from Landed UFO"

; THE LAZARUS PROJECT Mission Templates

[ChallengeRescueShen X2MissionTemplate]
DisplayName="Rescue Lily Shen from ADVENT Cell"
Briefing="Rescue Lily Shen from ADVENT Cell"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue Lily Shen from ADVENT custody"

[ChallengeRescueJaneKelly X2MissionTemplate]
DisplayName="Rescue Jane Kelly from ADVENT Train"
Briefing="Rescue Jane Kelly from ADVENT Train"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue Jane Kelly from ADVENT Train"

[ChallengeSabotageSiegeCannon X2MissionTemplate]
DisplayName="Sabotage the ADVENT Siege Cannon"
Briefing="Sabotage ADVENT Siege Cannon"
PostMissionType="Sabotage ADVENT Siege Cannon"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy forces"
ObjectiveTextPools[1]="Plant X4 on the siege cannon"

[ChallengeRescuePeterOsei X2MissionTemplate]
DisplayName="Rescue Peter Osei from ADVENT Cell"
Briefing="Rescue Peter Osei from ADVENT Cell"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue Peter Osei from ADVENT custody"

[ChallengeRescueAnaRamirez X2MissionTemplate]
DisplayName="Rescue Ana Ramirez from the Trainyard"
Briefing="Rescue Ana Ramirez from the Trainyard"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue Ana Ramirez from ADVENT custody"

[ChallengeExtractTygan X2MissionTemplate]
DisplayName="Extract Tygan from the Tunnels"
Briefing="Extract Tygan from the Tunnels"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Deliver Tygan to extraction point"

[ChallengeRecoverSweater X2MissionTemplate]
DisplayName="Recover Artifact from ADVENT Stronghold"
Briefing="Recover Artifact - ADVENT Stronghold"
PostMissionType="Recover Item"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover Artifact from ADVENT Stronghold"

; BLAST FROM THE PAST Mission Narrative Templates

[DefaultChallengeAbductionGasStation X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"

[DefaultChallengeAbductionCemetery X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"

[DefaultChallengeTerrorBar X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue at least 6 Civilians from ADVENT Forces"
ObjectiveTextPools[1]="Neutralize the ADVENT strike force"

[DefaultChallengeAbductionTrainyard X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"

[DefaultChallengeTerrorPoliceStation X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue at least 6 Civilians from ADVENT Forces"
ObjectiveTextPools[1]="Neutralize the ADVENT strike force"

[DefaultChallengeAbductionFarm X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"

[DefaultChallengeAbductionDam X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"

; IT CAME FROM THE SEA Mission Narrative Templates

[DefaultChallengeAbductionWaterfront X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"

[DefaultChallengeTerrorCoastalRadio X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue at least 6 Civilians from Alien Forces"
ObjectiveTextPools[1]="Neutralize the Alien strike force"

[DefaultChallengeDestroyWaterfrontRadio X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all hostile targets"
ObjectiveTextPools[1]="Destroy the radio before transmission completes"

[DefaultChallengeGatherWaterfrontRadio X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Locate the Pirate DJ"
ObjectiveTextPools[1]="Rescue the Pirate DJ"
ObjectiveTextPools[2]="Optional: Rescue the DJ's bodyguards"
ObjectiveTextPools[3]="Extract the DJ at the designated EVAC"
ObjectiveTextPools[4]="Extract at least one XCOM operative"

[DefaultChallengeExtractCoastalRadio X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Extract the DJ at designated location"
ObjectiveTextPools[2]="Extract at least one XCOM operative"

[DefaultChallengeHackWaterfrontRadio X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Hack the pirate radio"

[DefaultChallengeSabotageWaterfrontTransmitter X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Plant X4 to Destroy Alien Transmitter"
ObjectiveTextPools[1]="Extract at least one XCOM operative"

; AVENGER ASSEMBLE Mission Narrative Templates

[DefaultChallengeRecoverChair X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Scan Avalanche Missiles"

[DefaultChallengeRecoverRotor X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Scan Rotor Assembly"

[DefaultChallengeRecoverMissiles X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Scan Pilot Seat"

[DefaultChallengeHackPowerGrid X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Hack the UFO AI System"

[DefaultChallengeGatherSkyranger X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Locate the Black Market Trader"
ObjectiveTextPools[1]="Rescue the Black Market Trader"
ObjectiveTextPools[2]="Optional: Rescue the Black Market Guards"
ObjectiveTextPools[3]="Extract the Trader at the designated EVAC"
ObjectiveTextPools[4]="Extract at least one XCOM operative"

[DefaultChallengeProtectUFODevice X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Protect Data Interceptor Device"
ObjectiveTextPools[1]="Neutralize all enemy targets"

[DefaultChallengeRecoverManual X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Recover Power Stabilizer"

; THE LAZARUS PROJECT Mission Narrative Templates

[DefaultChallengeRescueShen X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue Shen from ADVENT Prison"
ObjectiveTextPools[1]="Extract Shen at designated location"
ObjectiveTextPools[2]="Extract at least one XCOM operative"

[DefaultChallengeRescueJaneKelly X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue Jane Kelly from ADVENT Prison"
ObjectiveTextPools[1]="Extract Jane Kelly at designated location"
ObjectiveTextPools[2]="Extract at least one XCOM operative"

[DefaultChallengeSabotageSiegeCannon X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Plant X4 to Destroy Siege Cannon"
ObjectiveTextPools[1]="Extract at least one XCOM operative"

[DefaultChallengeRescuePeterOsei X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue Peter Osei from ADVENT Prison"
ObjectiveTextPools[1]="Extract Peter Osei at designated location"
ObjectiveTextPools[2]="Extract at least one XCOM operative"

[DefaultChallengeRescueAnaRamirez X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue Ana Ramirez from ADVENT Custody"
ObjectiveTextPools[1]="Extract Ana Ramirez at designated location"
ObjectiveTextPools[2]="Extract at least one XCOM operative"

[DefaultChallengeExtractTygan X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Extract Tygan at designated location"
ObjectiveTextPools[2]="Extract at least one XCOM operative"

[DefaultChallengeRecoverSweater X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Central must remain conscious"
ObjectiveTextPools[1]="Neutralize all enemy targets"
ObjectiveTextPools[2]="Locate the Stasis Tube"
ObjectiveTextPools[3]="Central must Recover the Prototype from the Stasis Tube"

; IT CAME FROM THE SEA Quest Item Templates

[WaterfrontRadio X2QuestItemTemplate]
FriendlyName="Waterfront Radio"
FriendlyNamePlural="Waterfront Radios"
LootTooltip="Disable the maritime pirate radio to stop the Chryssalid invasion."

; AVENGER ASSEMBLE Quest Item Templates

[PilotSeat X2QuestItemTemplate]
FriendlyName="Interceptor Pilot Seat"
FriendlyNamePlural="Interceptor Pilot Seats"
LootTooltip="This would make a really good helm for the Avenger."

[RotorMechanism X2QuestItemTemplate]
FriendlyName="Skyranger Rotor Mechanism"
FriendlyNamePlural="Skyranger Rotor Mechanisms"
LootTooltip="This could be used to retrofit some of the Avenger's ailing systems."

[AvalancheMissiles X2QuestItemTemplate]
FriendlyName="Avalanche Missile"
FriendlyNamePlural="Avalanche Missiles"
LootTooltip="Shen would like to re-purpose their guidance systems for the Avenger."

[OperatorsManual X2QuestItemTemplate]
FriendlyName="Power Stabilizer"
FriendlyNamePlural="Power Stabilizers"
LootTooltip="The alien power stabilizer will help the Avenger get back in the air."

; THE LAZARUS PROJECT Quest Item Templates

[Sweater X2QuestItemTemplate]
FriendlyName="Bradford's Sweater"
FriendlyNamePlural="Bradford's Sweaters"
BriefSummary="The sweater, the myth, the outerwear.  The most iconic clothing of the XCOM project."

; IT CAME FROM THE SEA Hack Reward Templates

[WaterfrontRadio X2HackRewardTemplate]
FriendlyName="Waterfront Radio"
Description="Disable the maritime pirate radio to stop the Chryssalid invasion."

; AVENGER ASSEMBLE Hack Reward Templates

[PilotSeat X2HackRewardTemplate]
FriendlyName="Interceptor Pilot Seat"
Description="Make a scan of this seat for use as a helm on the Avenger."

[RotorMechanism X2HackRewardTemplate]
FriendlyName="Skyranger Rotor Mechanism"
Description="Make a scan of this drive assembly for use in Shen's retrofit of the Avenger."

[UFOPowerGrid X2HackRewardTemplate]
FriendlyName="Alien Navigation System"
Description="This alien navigation system will help the Avenger get back in the air."

[AvalancheMissiles X2HackRewardTemplate]
FriendlyName="Avalanche Missile"
Description="Make a scan of these missiles' guidance systems for the Avenger."

[OperatorsManual X2HackRewardTemplate]
FriendlyName="Power Stabilizer"
Description="This alien power stabilizer will help the Avenger get back in the air."

; Mission strings

[LadderMissionTimers]
TimerICFTSHackTitle="Disable The Pirate Radio"
TimerICFTSHackSubtitle="Turns until overrun"
TimerCouncilTitle="Extract all units"
TimerCouncilSubtitle="Turns until overrun"
TimerAAHackTitle="Hack The UFO AI System"
TimerAAHackSubtitle="Turns until irradiation"
TimerRelayTitle="Destroy The Pirate Radio"
TimerRelaySubtitle="Turns until overrun"
TimerSabotageTitle="X4 Charges"
TimerSabotageSubtitle="Turns until detonation"

;-----------------------
; TLE WEAPONS
;-----------------------

[TLE_AssaultRifle_CV X2WeaponTemplate]
FriendlyName="Old-world Assault Rifle"
FriendlyNamePlural="Old-world Assault Rifles"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Old-world Assault Rifle"

[TLE_AssaultRifle_MG X2WeaponTemplate]
FriendlyName="Improvised Magnetic Rifle"
FriendlyNamePlural="Improvised Magnetic Rifles"
BriefSummary="Magnetized projectile tech has enabled us to create rifle-style slugthrowers. They represent a substantial improvement in power relative to conventional assault rifles."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Improvised Magnetic Rifle"

[TLE_AssaultRifle_BM X2WeaponTemplate]
FriendlyName="Prototype Plasma Rifle"
FriendlyNamePlural="Prototype Plasma Rifles"
BriefSummary="Now that we've finally deciphered the aliens' devastating weapon technology and can develop beam weapons of our own, we can build rifles that will be the match of any enemy our soldiers encounter in the field."
TacticalText="<Bullet/> The Plasma Rifle is a general purpose, supremely powerful primary infantry weapons system.\n<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Prototype Plasma Rifle"

[TLE_Cannon_CV X2WeaponTemplate]
FriendlyName="Light Machine Gun"
FriendlyNamePlural="Light Machine Guns"
BriefSummary="The LMG is an improvised light support weapon, specialized for high volume fire. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Light Machine Gun"

[TLE_Cannon_MG X2WeaponTemplate]
FriendlyName="Magnetic Support Cannon"
FriendlyNamePlural="Magnetic Support Cannons"
BriefSummary="Magnetic weapons tech will let us deploy a rapid-fire version of the cannon. Our Grenadiers will be able to lay down a much deadlier volume of fire."
TacticalText="<Bullet/> The Magnetic Support Cannon is a much more powerful, yet equally deployable, version of the conventional LMG.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Magnetic Support Cannon"

[TLE_Cannon_BM X2WeaponTemplate]
FriendlyName="Energy Cannon"
FriendlyNamePlural="Energy Cannons"
BriefSummary="Devising a more powerful, high-volume beam weapon for our Grenadiers required substantial effort, but the firepower it brings is unquestioned."
TacticalText="<Bullet/> The Energy Cannon is the most powerful combat support weapon human forces can deploy.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Energy Cannon"

[TLE_Pistol_CV X2WeaponTemplate]
FriendlyName="Traditional Handgun"
FriendlyNamePlural="Traditional Handguns"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."
AbilityDescName="Traditional Handgun"

[TLE_Pistol_MG X2WeaponTemplate]
FriendlyName="Rail Pistol"
FriendlyNamePlural="Rail Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Rail pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the Marksman's rifle, pistols can be fired with a single action."
AbilityDescName="Rail Pistol"

[TLE_Pistol_BM X2WeaponTemplate]
FriendlyName="Energy Pistol"
FriendlyNamePlural="Energy Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Energy pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the Marksman's rifle, pistols can be fired with a single action."
AbilityDescName="Energy pistol"

[TLE_Shotgun_CV X2WeaponTemplate]
FriendlyName="Scattergun"
FriendlyNamePlural="Scatterguns"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is a specialized weapon for close range engagement. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/> Shotguns are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Scattergun"

[TLE_Shotgun_MG X2WeaponTemplate]
FriendlyName="Augmented Shotgun"
FriendlyNamePlural="Augmented Shotguns"
BriefSummary="Magnetic weapons technology will let us synthesize alien alloy fragments into a spray-style projectile, and our Rangers can use it to dramatic effect: the closer the better."
TacticalText="<Bullet/> Magnetized weapon technology makes for an especially effective improvement of XCOM's combat shotgun.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Augmented Shotgun"

[TLE_Shotgun_BM X2WeaponTemplate]
FriendlyName="Energy Sweeper"
FriendlyNamePlural="Energy Sweepers"
BriefSummary="The Energy Sweeper fires a concentrated set of beam pulses, piercing and melting the target across a substantial surface area."
TacticalText="<Bullet/> This is the most advanced shotgun-style weapon available in the XCOM arsenal.\n<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Energy Sweeper"

[TLE_SniperRifle_CV X2WeaponTemplate]
FriendlyName="Marksman's Rifle"
FriendlyNamePlural="Marksman's Rifles"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is a specialized weapon for medium to long range engagement. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> The sniper rifle always takes two actions to fire.\n<Bullet/> The sniper rifle suffers a penalty to hit at close range.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Marksman's Rifle"

[TLE_SniperRifle_MG X2WeaponTemplate]
FriendlyName="Anti-Materiel Rifle"
FriendlyNamePlural="Anti-Materiel Rifles"
BriefSummary="Magnetic weapons technology has particular utility for precision slow-fire weapons like sniper rifles. The Gauss Rifle will enable our Sharpshooters to cause greater damage at extended range."
TacticalText="<Bullet/> Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Anti-Materiel Rifle"

[TLE_SniperRifle_BM X2WeaponTemplate]
FriendlyName="Energy AMR"
FriendlyNamePlural="Energy AMRs"
BriefSummary="The aliens' focused beam technology has obvious applications for improving sniper rifles. The Plasma Lance is an unmatched sniper rifle."
TacticalText="<Bullet/> This is the apex of sniper rifle technology.\n<Bullet/> Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Modern upgrades are unavailable due to the weapon's age."
AbilityDescName="Energy AMR"

[TLE_Sword_CV X2WeaponTemplate]
FriendlyName="Traditional Sword"
FriendlyNamePlural="Traditional Swords"
BriefSummary="XCOM Rangers train in the use of edged weapons, enabling them to take out enemies in close combat."
TacticalText="<Bullet/> Rangers can attack adjacent enemies with their sword even after using both actions to move or dash to the extent of their movement range.\n<Bullet/> The decision to engage the enemy in melee combat can be a decisive one; exercise caution.\n<Bullet/> Keep an eye out for opportunities to improve our edged weapon effectiveness - the enemy may have access to much better technology."
AbilityDescName="Traditional Sword"

[TLE_Sword_MG X2WeaponTemplate]
FriendlyName="Experimental Blade"
FriendlyNamePlural="Experimental Blades"
BriefSummary="When pure kinetic energy is no longer sufficient in the field, the Arc Blade may prove necessary. It boosts the standard Sword's combat effectiveness with the addition of an electric field, capable of stunning enemies that are not killed outright."
TacticalText="<Bullet/> The Experimental Blade adds a powerful electric burst to the sword's kinetic impact, improving its damage and adding a chance to stun enemy targets."
AbilityDescName="Experimental Blade"

[TLE_Sword_BM X2WeaponTemplate]
FriendlyName="Advanced Blade"
FriendlyNamePlural="Advanced Blades"
BriefSummary="The Advanced Blade encases a plasma-heated metallic core in a micro-thin magnetic field, enabling devastating melee attacks that are capable of setting enemies aflame."
TacticalText="<Bullet/> This is the most advanced version of the Ranger's sword, dealing maximum damage with a chance to burn enemy targets."
AbilityDescName="Advanced Blade"

[RangerKevlarArmor X2ArmorTemplate]
FriendlyName="Improvised Ranger Field Armor"
FriendlyNamePlural="Improvised Ranger Field Armor"
BriefSummary="This basic armor consists of improvised protection cobbled together from salvage and Resistance arms caches. It provides minimal protection against ADVENT and alien weaponry."
TacticalText="<Bullet/> All soldiers receive Kevlar Armor as part of their basic kit.\n<Bullet/> Research can give us access to better armor."

[GrenadierKevlarArmor X2ArmorTemplate]
FriendlyName="Improvised Grenadier Field Armor"
FriendlyNamePlural="Improvised Grenadier Field Armor"
BriefSummary="This basic armor consists of improvised protection cobbled together from salvage and Resistance arms caches. It provides minimal protection against ADVENT and alien weaponry."
TacticalText="<Bullet/> All soldiers receive Kevlar Armor as part of their basic kit.\n<Bullet/> Research can give us access to better armor."

[SpecialistKevlarArmor X2ArmorTemplate]
FriendlyName="Improvised Specialist Field Armor"
FriendlyNamePlural="Improvised Specialist Field Armor"
BriefSummary="This basic armor consists of improvised protection cobbled together from salvage and Resistance arms caches. It provides minimal protection against ADVENT and alien weaponry."
TacticalText="<Bullet/> All soldiers receive Kevlar Armor as part of their basic kit.\n<Bullet/> Research can give us access to better armor."

[SharpshooterKevlarArmor X2ArmorTemplate]
FriendlyName="Improvised Sharpshooter Field Armor"
FriendlyNamePlural="Improvised Sharpshooter Field Armor"
BriefSummary="This basic armor consists of improvised protection cobbled together from salvage and Resistance arms caches. It provides minimal protection against ADVENT and alien weaponry."
TacticalText="<Bullet/> All soldiers receive Kevlar Armor as part of their basic kit.\n<Bullet/> Research can give us access to better armor."

[PsiOperativeKevlarArmor X2ArmorTemplate]
FriendlyName="Improvised Psi Operative Field Armor"
FriendlyNamePlural="Improvised Psi Operative Field Armor"
BriefSummary="This basic armor consists of improvised protection cobbled together from salvage and Resistance arms caches. It provides minimal protection against ADVENT and alien weaponry."
TacticalText="<Bullet/> All soldiers receive Kevlar Armor as part of their basic kit.\n<Bullet/> Research can give us access to better armor."

[RangerPlatedArmor X2ArmorTemplate]
FriendlyName="Enhanced Ranger Field Plate"
FriendlyNamePlural="Enhanced Ranger Field Plate"
BriefSummary="Using scavenged plates of ADVENT armor, this suit provides increased protection and additional inventory capacity for our soldiers."
TacticalText="<Bullet/> Mid-weight armor based on ADVENT salvage.\n<Bullet/> As a medium-class armor, it provides a slot for one additional inventory item."

[GrenadierPlatedArmor X2ArmorTemplate]
FriendlyName="Enhanced Grenadier Field Plate"
FriendlyNamePlural="Enhanced Grenadier Field Plate"
BriefSummary="Using scavenged plates of ADVENT armor, this suit provides increased protection and additional inventory capacity for our soldiers."
TacticalText="<Bullet/> Mid-weight armor based on ADVENT salvage.\n<Bullet/> As a medium-class armor, it provides a slot for one additional inventory item."

[SpecialistPlatedArmor X2ArmorTemplate]
FriendlyName="Enhanced Specialist Field Plate"
FriendlyNamePlural="Enhanced Specialist Field Plate"
BriefSummary="Using scavenged plates of ADVENT armor, this suit provides increased protection and additional inventory capacity for our soldiers."
TacticalText="<Bullet/> Mid-weight armor based on ADVENT salvage.\n<Bullet/> As a medium-class armor, it provides a slot for one additional inventory item."

[SharpshooterPlatedArmor X2ArmorTemplate]
FriendlyName="Enhanced Sharpshooter Field Plate"
FriendlyNamePlural="Enhanced Sharpshooter Field Plate"
BriefSummary="Using scavenged plates of ADVENT armor, this suit provides increased protection and additional inventory capacity for our soldiers."
TacticalText="<Bullet/> Mid-weight armor based on ADVENT salvage.\n<Bullet/> As a medium-class armor, it provides a slot for one additional inventory item."

[PsiOperativePlatedArmor X2ArmorTemplate]
FriendlyName="Enhanced Psi Operative Field Plate"
FriendlyNamePlural="Enhanced Psi Operative Field Plate"
BriefSummary="Using scavenged plates of ADVENT armor, this suit provides increased protection and additional inventory capacity for our soldiers."
TacticalText="<Bullet/> Mid-weight armor based on ADVENT salvage.\n<Bullet/> As a medium-class armor, it provides a slot for one additional inventory item."

[RangerPoweredArmor X2ArmorTemplate]
FriendlyName="Experimental Ranger Power Armor"
FriendlyNamePlural="Experimental Ranger Power Armor"
BriefSummary="Our new mastery of the alien's Elerium technology has lead us to the ultimate in battle armor: the Warden Armor. Elerium powered armor provides unprecedented survivability and versatility in the battle against increasingly powerful alien enemies."
TacticalText="<Bullet/> Top tier medium-class armor available.\n<Bullet/> Power Armor has 2 inventory item slots."

[GrenadierPoweredArmor X2ArmorTemplate]
FriendlyName="Experimental Grenadier Power Armor"
FriendlyNamePlural="Experimental Grenadier Power Armor"
BriefSummary="Our new mastery of the alien's Elerium technology has lead us to the ultimate in battle armor: the Warden Armor. Elerium powered armor provides unprecedented survivability and versatility in the battle against increasingly powerful alien enemies."
TacticalText="<Bullet/> Top tier medium-class armor available.\n<Bullet/> Power Armor has 2 inventory item slots."

[SpecialistPoweredArmor X2ArmorTemplate]
FriendlyName="Experimental Specialist Power Armor"
FriendlyNamePlural="Experimental Specialist Power Armor"
BriefSummary="Our new mastery of the alien's Elerium technology has lead us to the ultimate in battle armor: the Warden Armor. Elerium powered armor provides unprecedented survivability and versatility in the battle against increasingly powerful alien enemies."
TacticalText="<Bullet/> Top tier medium-class armor available.\n<Bullet/> Power Armor has 2 inventory item slots."

[SharpshooterPoweredArmor X2ArmorTemplate]
FriendlyName="Experimental Sharpshooter Power Armor"
FriendlyNamePlural="Experimental Sharpshooter Power Armor"
BriefSummary="Our new mastery of the alien's Elerium technology has lead us to the ultimate in battle armor: the Warden Armor. Elerium powered armor provides unprecedented survivability and versatility in the battle against increasingly powerful alien enemies."
TacticalText="<Bullet/> Top tier medium-class armor available.\n<Bullet/> Power Armor has 2 inventory item slots."

[PsiOperativePoweredArmor X2ArmorTemplate]
FriendlyName="Experimental Psi Operative Power Armor"
FriendlyNamePlural="Experimental Psi Operative Power Armor"
BriefSummary="Our new mastery of the alien's Elerium technology has lead us to the ultimate in battle armor: the Warden Armor. Elerium powered armor provides unprecedented survivability and versatility in the battle against increasingly powerful alien enemies."
TacticalText="<Bullet/> Top tier medium-class armor available.\n<Bullet/> Power Armor has 2 inventory item slots."

; Helmet Tier 1 ///////////////////////////

;Tier 1 A & variant
[TLE_Helmet_Tier1_A_M X2BodyPartTemplate]
DisplayName="Commlink Helmet with Goggles"
[TLE_Helmet_Tier1_A_F X2BodyPartTemplate]
DisplayName="Commlink Helmet with Goggles"
[TLE_Helmet_Tier1_A2_M X2BodyPartTemplate]
DisplayName="Commlink Helmet"
[TLE_Helmet_Tier1_A2_F X2BodyPartTemplate]
DisplayName="Commlink Helmet"

;Tier 1 B & variant
[TLE_Helmet_Tier1_B_M X2BodyPartTemplate]
DisplayName="Corded Hood with Mask"
[TLE_Helmet_Tier1_B_F X2BodyPartTemplate]
DisplayName="Corded Hood with Mask"
[TLE_Helmet_Tier1_B2_M X2BodyPartTemplate]
DisplayName="Corded Hood"
[TLE_Helmet_Tier1_B2_F X2BodyPartTemplate]
DisplayName="Corded Hood"

;Tier 1 C & variant
[TLE_Helmet_Tier1_C_M X2BodyPartTemplate]
DisplayName="Skyranger Pilot with Goggles"
[TLE_Helmet_Tier1_C_F X2BodyPartTemplate]
DisplayName="Skyranger Pilot with Goggles"
[TLE_Helmet_Tier1_C2_M X2BodyPartTemplate]
DisplayName="Salvaged Skyranger Pilot "
[TLE_Helmet_Tier1_C2_F X2BodyPartTemplate]
DisplayName="Salvaged Skyranger Pilot "

;Tier 1 D & variant
[TLE_Helmet_Tier1_D_M X2BodyPartTemplate]
DisplayName="Tunnel Rat Helmet"
[TLE_Helmet_Tier1_D_F X2BodyPartTemplate]
DisplayName="Tunnel Rat Helmet"
[TLE_Helmet_Tier1_D2_M X2BodyPartTemplate]
DisplayName="Tunnel Rat Helmet without Light"
[TLE_Helmet_Tier1_D2_F X2BodyPartTemplate]
DisplayName="Tunnel Rat Helmet without Light"
 
 ; Helmet Tier 2 ///////////////////////////

;Tier 2 A & variant
[TLE_Helmet_Tier2_A_M X2BodyPartTemplate]
DisplayName="Plated Braincase"
[TLE_Helmet_Tier2_A_F X2BodyPartTemplate]
DisplayName="Plated Braincase"
[TLE_Helmet_Tier2_A2_M X2BodyPartTemplate]
DisplayName="Refined Plated Braincase"
[TLE_Helmet_Tier2_A2_F X2BodyPartTemplate]
DisplayName="Refined Plated Braincase"

;Tier 2 B & variant
[TLE_Helmet_Tier2_B_M X2BodyPartTemplate]
DisplayName="Rough Biochem Filter"
[TLE_Helmet_Tier2_B_F X2BodyPartTemplate]
DisplayName="Rough Biochem Filter"
[TLE_Helmet_Tier2_B2_M X2BodyPartTemplate]
DisplayName="Armored Biochem Filter"
[TLE_Helmet_Tier2_B2_F X2BodyPartTemplate]
DisplayName="Armored Biochem Filter"

;Tier 2 C
[TLE_Helmet_Tier2_C_M X2BodyPartTemplate]
DisplayName="Cracked Visor"
[TLE_Helmet_Tier2_C_F X2BodyPartTemplate]
DisplayName="Cracked Visor"

;Tier 2 D & variant
[TLE_Helmet_Tier2_D_M X2BodyPartTemplate]
DisplayName="Vented Tactical Helmet"
[TLE_Helmet_Tier2_D_F X2BodyPartTemplate]
DisplayName="Vented Tactical Helmet"
[TLE_Helmet_Tier2_D2_M X2BodyPartTemplate]
DisplayName="Plated Tactical Helmet"
[TLE_Helmet_Tier2_D2_F X2BodyPartTemplate]
DisplayName="Plated Tactical Helmet"

;Helmet Tier 3///////////////////////////

;Tier 3 A. 
[TLE_Helmet_Tier3_A_M X2BodyPartTemplate]
DisplayName="Full Faceplate"
[TLE_Helmet_Tier3_A_F X2BodyPartTemplate]
DisplayName="Full Faceplate"

;Tier 3 B & variant
[TLE_Helmet_Tier3_B_M X2BodyPartTemplate]
DisplayName="Thermoregulated Hood"
[TLE_Helmet_Tier3_B_F X2BodyPartTemplate]
DisplayName="Thermoregulated Hood"
[TLE_Helmet_Tier3_B2_M X2BodyPartTemplate]
DisplayName="Steel Hood"
[TLE_Helmet_Tier3_B2_F X2BodyPartTemplate]
DisplayName="Steel Hood"

;Tier 3 C & variant
[TLE_Helmet_Tier3_C_M X2BodyPartTemplate]
DisplayName="Wired Space Force Helm"
[TLE_Helmet_Tier3_C_F X2BodyPartTemplate]
DisplayName="Wired Space Force Helm"
[TLE_Helmet_Tier3_C2_M X2BodyPartTemplate]
DisplayName="Space Force Helm"
[TLE_Helmet_Tier3_C2_F X2BodyPartTemplate]
DisplayName="Space Force Helm"

;Tier 3 D & variant
[TLE_Helmet_Tier3_D_M X2BodyPartTemplate]
DisplayName="Enhanced Stalker Helmet"
[TLE_Helmet_Tier3_D_F X2BodyPartTemplate]
DisplayName="Enhanced Stalker Helmet"
[TLE_Helmet_Tier3_D2_M X2BodyPartTemplate]
DisplayName="Stalker Helmet"
[TLE_Helmet_Tier3_D2_F X2BodyPartTemplate]
DisplayName="Stalker Helmet"

;New male voice 

[RolandVoice1_English_US X2BodyPartTemplate]
DisplayName="The Rizzo"

; --------------------------------------------------------------------------------------------------------------------------------------------------------
; To update, add, or remove attitude animations, change the list below, then contact programmer to edit X2StrategyElement_TLESoldierPersonalities.uc file
; //xcom2/main/XCOM2/Development/Src/TLE/Classes/X2StrategyElement_TLESoldierPersonalities.uc
; --------------------------------------------------------------------------------------------------------------------------------------------------------

[Personality_TLE1 X2SoldierPersonalityTemplate]
FriendlyName="Angry"

[Personality_TLE2 X2SoldierPersonalityTemplate]
FriendlyName="Cocky"

[Personality_TLE3 X2SoldierPersonalityTemplate]
FriendlyName="Suspicious"

[Personality_TLE4 X2SoldierPersonalityTemplate]
FriendlyName="Smug"

[Personality_TLE5 X2SoldierPersonalityTemplate]
FriendlyName="Let's Go!"

; Ladder Progression Upgrades

[HunterWeaponsSpecialist X2LadderUpgradeTemplate]
ShortDescription="Alien Hunters Weapons"
FullDescription="Add the Alien Hunters Rifle, Pistol, Axe, and Frost Bombs to your squad"

[HunterWeaponsPsiOp X2LadderUpgradeTemplate]
ShortDescription="Alien Hunters Weapons"
FullDescription="Add the Alien Hunters Rifle, Pistol, Axe, and Frost Bombs to your squad Psi Op version"

[ChosenRifleSpecialist X2LadderUpgradeTemplate]
ShortDescription="Chosen Disruptor Rifle"
FullDescription="Give your specialist the Disruptor Rifle"

[ChosenRiflePsiOp X2LadderUpgradeTemplate]
ShortDescription="Chosen Disruptor Rifle"
FullDescription="Give your PsiOps the Disruptor Rifle"

[ChosenShotgunRanger X2LadderUpgradeTemplate]
ShortDescription="Chosen Arashi"
FullDescription="Give your Ranger the Arashi"

[ChosenSwordRanger X2LadderUpgradeTemplate]
ShortDescription="Chosen Katana"
FullDescription="Give your Ranger the Katana"

[ChosenSniperSharpshooter X2LadderUpgradeTemplate]
ShortDescription="Chosen Darklance"
FullDescription="Give your Sharpshooter the Darklance"

[ChosenPistolSharpshooter X2LadderUpgradeTemplate]
ShortDescription="Chosen Darkclaw"
FullDescription="Give your Sharpshooter the Darkclaw"

[ExperimentalPlatedArmor X2LadderUpgradeTemplate]
ShortDescription="Spider Suit & E.X.O. Suit"
FullDescription="Give your Sharpshooter and Ranger Spider Suits, and give your Grenadier and Psi Op E.X.O. Suits"

[ExperimentalPoweredArmor X2LadderUpgradeTemplate]
ShortDescription="Wraith Suit & WAR Suit"
FullDescription="Give your Sharpshooter and Ranger Wraith Suits, and give your Grenadier and Psi Op WAR Suits"

[ExperimentalPoweredWeapons X2LadderUpgradeTemplate]
ShortDescription="Experimental Powered Weapons"
FullDescription="Gain new powerful weapons"

[HunterArmor X2LadderUpgradeTemplate]
ShortDescription="Alien Hunters Armors"
FullDescription="Give your units light, medium, and heavy Alien Armor"

[HunterArmorMk2 X2LadderUpgradeTemplate]
ShortDescription="Alien Hunters Armors"
FullDescription="Give your units light, medium, and heavy Alien Armor"

[ExperimentalAmmo X2LadderUpgradeTemplate]
ShortDescription="Experimental Ammo Types"
FullDescription="Give your units new ammo types"

[ExperimentalGrenades X2LadderUpgradeTemplate]
ShortDescription="Experimental Grenades"
FullDescription="Give your units new grenade types"

[AdvancedExplosives X2LadderUpgradeTemplate]
ShortDescription="Advanced Explosives"
FullDescription="Give your units advanced new grenade types"

[BasicPCSes X2LadderUpgradeTemplate]
ShortDescription="Basic Personal Combat Sims"
FullDescription="Give your units low level PCS"

[AdvancedPCSes X2LadderUpgradeTemplate]
ShortDescription="Advanced Personal Combat Sims"
FullDescription="Give your units medium level PCS"

[SuperiorPCSes X2LadderUpgradeTemplate]
ShortDescription="Superior Personal Combat Sims"
FullDescription="Give your units High level PCS"

[BasicWeaponUpgrades X2LadderUpgradeTemplate]
ShortDescription="Basic Weapon Upgrades"
FullDescription="Give your units low level weapon upgrades"

[AdvancedWeaponUpgrades X2LadderUpgradeTemplate]
ShortDescription="Advanced Weapon Upgrades"
FullDescription="Give your units medium level weapon upgrades"

[SuperiorWeaponUpgrades X2LadderUpgradeTemplate]
ShortDescription="Superior Weapon Upgrades"
FullDescription="Give your units high level weapon upgrades"

[ExperimentalVests X2LadderUpgradeTemplate]
ShortDescription="Experimental Vests"
FullDescription="Give your units experimental vest armor"

[UtilityItems X2LadderUpgradeTemplate]
ShortDescription="Utility Items"
FullDescription="Give your units utility items"

[Interact_SweaterTube X2AbilityTemplate]
LocFriendlyName="Open Stasis Tube"
LocHelpText="Opens the ADVENT Stasis Tube."

[Hack_Scan X2AbilityTemplate]
LocFriendlyName="Scan Object"
LocHelpText="Make a scan of this object to create a 3D blueprint."
LocFlyOverText="Scanning"

[IntrusionProtocol_Scan X2AbilityTemplate]
LocFriendlyName="Scan Object"
LocLongDescription="Make a scan of this object to create a 3D blueprint with your <Ability:SECONDARYWEAPONNAME/>."
LocHelpText="You can scan objects with your <Ability:SECONDARYWEAPONNAME/>."
LocFlyOverText="Scan"
LocDefaultSecondaryWeapon="GREMLIN"

; Character templates

[NarrativeCentral X2CharacterTemplate]
strForcedFirstName="John"
strForcedLastName="Bradford"
strForcedNickName="Central"

[LadderShen X2CharacterTemplate]
strForcedFirstName="An-Yi"
strForcedLastName="Shen"
strForcedNickName="Lily"

[JaneKelly X2CharacterTemplate]
strForcedFirstName="Jane"
strForcedLastName="Kelly"
strForcedNickName="Quiet"

[PeterOsei X2CharacterTemplate]
strForcedFirstName="Peter"
strForcedLastName="Osei"
strForcedNickName="Rowdy"

[AnaRamirez X2CharacterTemplate]
strForcedFirstName="Ana"
strForcedLastName="Ramirez"
strForcedNickName="Skinner"

[PirateDJ_VIP X2CharacterTemplate]
strForcedFirstName="Jake"
strForcedLastName="Levy"
strForcedNickName="The DJ"
strCharacterName="Radio DJ"

[BlackMarketTrader_VIP X2CharacterTemplate]
strForcedFirstName="Dubravka"
strForcedLastName="Horvat"
strForcedNickName="Masha"

[LilyShen_VIP X2CharacterTemplate]
strForcedFirstName="An-Yi"
strForcedLastName="Shen"
strForcedNickName="Lily"

[JaneKelly_VIP X2CharacterTemplate]
strForcedFirstName="Jane"
strForcedLastName="Kelly"
strForcedNickName="Quiet"

[PeterOsei_VIP X2CharacterTemplate]
strForcedFirstName="Peter"
strForcedLastName="Osei"
strForcedNickName="Rowdy"

[AnaRamirez_VIP X2CharacterTemplate]
strForcedFirstName="Ana"
strForcedLastName="Ramirez"
strForcedNickName="Skinner"

[Tygan_VIP X2CharacterTemplate]
strForcedFirstName="Charles"
strForcedLastName="Tygan"
strForcedNickName="Hamburgler"

[PsiZombieCivilian X2CharacterTemplate]
strCharacterName="Zombie"

[NeonateChryssalid X2CharacterTemplate]
strCharacterName="Neonate Chryssalid"

; Soldier Class Templates

[LadderCentral X2SoldierClassTemplate]
DisplayName="Ranger"
ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Assault"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Assault"
AbilityTreeTitles[2]="XCOM"

[TLE_ChiefEngineer X2SoldierClassTemplate]
DisplayName="Specialist"
ClassSummary="Operating some of our most advanced equipment, Specialists deploy robotic drones on the battlefield that can be outfitted for combat or field medic duty."
LeftAbilityTreeTitle="Battle Medic"
RightAbilityTreeTitle="Combat Hacker"
AbilityTreeTitles[0]="Battle Medic"
AbilityTreeTitles[1]="Combat Hacker"
AbilityTreeTitles[2]="XCOM"

;-----------------------
; Shen's Gremlin
;-----------------------
[Shen_Gremlin_CV X2GremlinTemplate]
FriendlyName="ROV-R Mark I"
FriendlyNamePlural="ROV-R Mark I"
BriefSummary="The earliest Gremlin prototype developed by Lily Shen, the ROV-R unit has a number of peculiar behaviors thought to have been caused by the \"unique\" modifications added over the years."
TacticalText="<Bullet/> ROV-R allows Shen to execute a variety of battlefield tasks from safer distances.\n<Bullet/> ROV-R accompanies Shen, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> ROV-R generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."
AbilityDescName="ROV-R"

[Shen_Gremlin_MG X2GremlinTemplate]
FriendlyName="ROV-R Mark II"
FriendlyNamePlural="ROV-R Mark II"
BriefSummary="The earliest Gremlin prototype developed by Lily Shen, the ROV-R unit has a number of peculiar behaviors thought to have been caused by the \"unique\" modifications added over the years."
TacticalText="<Bullet/> ROV-R allows Shen to execute a variety of battlefield tasks from safer distances.\n<Bullet/> ROV-R accompanies Shen, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> ROV-R generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."
AbilityDescName="ROV-R"

[Shen_Gremlin_BM X2GremlinTemplate]
FriendlyName="ROV-R Mark III"
FriendlyNamePlural="ROV-R Mark III"
BriefSummary="The earliest Gremlin prototype developed by Lily Shen, the ROV-R unit has a number of peculiar behaviors thought to have been caused by the \"unique\" modifications added over the years."
TacticalText="<Bullet/> ROV-R allows Shen to execute a variety of battlefield tasks from safer distances.\n<Bullet/> ROV-R accompanies Shen, and can be issued protocols which aid allies, hack electronic targets, or damage enemies.\n<Bullet/> ROV-R generally goes unnoticed by enemies, and cannot take damage or be destroyed. It will shut down if its owner is incapacitated or killed."
AbilityDescName="ROV-R"

[X2Photobooth]
; TLE Photobooth Attitudes
+m_arrAnimationPoses=(AnimationDisplayName="Angry")
+m_arrAnimationPoses=(AnimationDisplayName="Cocky")
+m_arrAnimationPoses=(AnimationDisplayName="Let's Go!")
+m_arrAnimationPoses=(AnimationDisplayName="Smug")
+m_arrAnimationPoses=(AnimationDisplayName="Suspicious")

; TEL Photobooth Rifle
+m_arrAnimationPoses=(AnimationDisplayName="Iron Sights")
+m_arrAnimationPoses=(AnimationDisplayName="Pensive")
+m_arrAnimationPoses=(AnimationDisplayName="Seek & Destroy")

; TLE Photobooth Unarmed
+m_arrAnimationPoses=(AnimationDisplayName="Battle Cry")
+m_arrAnimationPoses=(AnimationDisplayName="Size 13, Baby!")

; TLE Photobooth Sharpshooter
+m_arrAnimationPoses=(AnimationDisplayName="Dual Wield 1")
+m_arrAnimationPoses=(AnimationDisplayName="Dual Wield 2")
+m_arrAnimationPoses=(AnimationDisplayName="Leap Of Faith")
+m_arrAnimationPoses=(AnimationDisplayName="Kill'em All!")
+m_arrAnimationPoses=(AnimationDisplayName="Never Surrender")
+m_arrAnimationPoses=(AnimationDisplayName="Final Exit")

; TLE Photobooth Ranger
+m_arrAnimationPoses=(AnimationDisplayName="Bring It!")
+m_arrAnimationPoses=(AnimationDisplayName="Quiet Death")
+m_arrAnimationPoses=(AnimationDisplayName="Death From Above")
+m_arrAnimationPoses=(AnimationDisplayName="Faceoff")

; TLE Photobooth Grenadier
+m_arrAnimationPoses=(AnimationDisplayName="Bring The Rain")
+m_arrAnimationPoses=(AnimationDisplayName="What The Hell?!")

; TLE Photobooth PsiOperative
+m_arrAnimationPoses=(AnimationDisplayName="Amped Up")
+m_arrAnimationPoses=(AnimationDisplayName="Die-Electric")

; TLE Photobooth Specialist
+m_arrAnimationPoses=(AnimationDisplayName="Sending Support")
+m_arrAnimationPoses=(AnimationDisplayName="Covering Fire")

; TLE Photobooth Reaper Specific
+m_arrAnimationPoses=(AnimationDisplayName="Silent Movement")
+m_arrAnimationPoses=(AnimationDisplayName="Heads Will Roll")

; TLE Photobooth Skirmisher
+m_arrAnimationPoses=(AnimationDisplayName="Vengeance")
+m_arrAnimationPoses=(AnimationDisplayName="Giddy Up")

; TLE Photobooth Templar
+m_arrAnimationPoses=(AnimationDisplayName="Deadly Strike")
+m_arrAnimationPoses=(AnimationDisplayName="Deflect")

; TLE Photobooth Duo Poses
+m_arrAnimationPoses=(AnimationDisplayName="Got Your 6")
+m_arrAnimationPoses=(AnimationDisplayName="Pistol Overwatch")
+m_arrAnimationPoses=(AnimationDisplayName="Rescue Left")
+m_arrAnimationPoses=(AnimationDisplayName="Rescue Right")
+m_arrAnimationPoses=(AnimationDisplayName="Delivery Left")
+m_arrAnimationPoses=(AnimationDisplayName="Delivery Right")
+m_arrAnimationPoses=(AnimationDisplayName="Bonded Left")
+m_arrAnimationPoses=(AnimationDisplayName="Bonded Right")
+m_arrAnimationPoses=(AnimationDisplayName="High Five Left")
+m_arrAnimationPoses=(AnimationDisplayName="High Five Right")

; TLE Photobooth Battle Poses
+m_arrAnimationPoses=(AnimationDisplayName="Viper Bind")
+m_arrAnimationPoses=(AnimationDisplayName="Muton Mash")

; TLE Photobooth Victory Poses
+m_arrAnimationPoses=(AnimationDisplayName="Victorious 1")
+m_arrAnimationPoses=(AnimationDisplayName="Victorious 2")
+m_arrAnimationPoses=(AnimationDisplayName="Victorious 3")


; TLE Photobooth Backgrounds
+m_arrBackgroundOptions=(BackgroundDisplayname="Wandering Horde")
+m_arrBackgroundOptions=(BackgroundDisplayname="Sectopod")
+m_arrBackgroundOptions=(BackgroundDisplayname="Sectoid Face")
+m_arrBackgroundOptions=(BackgroundDisplayname="Center Fade")
+m_arrBackgroundOptions=(BackgroundDisplayname="Bottom Fade")
+m_arrBackgroundOptions=(BackgroundDisplayname="Top Fade")
+m_arrBackgroundOptions=(BackgroundDisplayname="Avenger Landing")
+m_arrBackgroundOptions=(BackgroundDisplayname="Advent Standing")
+m_arrBackgroundOptions=(BackgroundDisplayname="Advent Soldier Outline")
+m_arrBackgroundOptions=(BackgroundDisplayname="Advent Captain")
+m_arrBackgroundOptions=(BackgroundDisplayname="Abstract Archon")
+m_arrBackgroundOptions=(BackgroundDisplayname="Abstract Advent")
+m_arrBackgroundOptions=(BackgroundDisplayname="Alien Head Blades")
+m_arrBackgroundOptions=(BackgroundDisplayname="Alien Skull Crush")
+m_arrBackgroundOptions=(BackgroundDisplayname="Fist Crushing Aliens")
+m_arrBackgroundOptions=(BackgroundDisplayname="XCOM Soldier")
